OpenNuvoton/NUC970_NonOS_BSP/SampleCode/eMMC_FATFS/main.c
    for (;;) {
        c = sysGetChar();
        sysPutChar(c);
        if (c == '\r') break;
        if ((c == '\b') && idx) idx--;
        if ((c >= ' ') && (idx < len - 1)) buff[idx++] = c;
    }
    buff[idx] = 0;

    sysPutChar('\n');

}

void FMI_IRQHandler(void)
{
    unsigned int volatile isr;
    unsigned int volatile ier;

    // FMI data abort interrupt
    if (inpw(REG_FMI_INTSTS) & FMI_INTSTS_DTAIF_Msk) {
        /* ResetAllEngine() */
        outpw(REG_FMI_CTL, inpw(REG_FMI_CTL) | FMI_CTL_CTLRST_Msk);
        outpw(REG_FMI_INTSTS, FMI_INTSTS_DTAIF_Msk);
    }

	//----- eMMC interrupt status
	isr = inpw(REG_FMI_EMMCINTSTS);
	if (isr & FMI_EMMCINTSTS_BLKDIF_Msk)		// block down
	{
		_fmi_eMMCDataReady = TRUE;
		outpw(REG_FMI_EMMCINTSTS, FMI_EMMCINTSTS_BLKDIF_Msk);
	}

    // CRC error interrupt
    if (isr & FMI_EMMCINTSTS_CRCIF_Msk) {
        if (!(isr & FMI_EMMCINTSTS_CRC16_Msk)) {
            // handle CRC error
        } else if (!(isr & FMI_EMMCINTSTS_CRC7_Msk)) {
            extern unsigned int _fmi_uR3_CMD;
            if (! _fmi_uR3_CMD) {
                // handle CRC error
            }
        }
        outpw(REG_FMI_EMMCINTSTS, FMI_EMMCINTSTS_CRCIF_Msk);      // clear interrupt flag
    }
}

void SYS_Init(void)
{
    /* enable FMI eMMC */
    outpw(REG_CLK_HCLKEN, (inpw(REG_CLK_HCLKEN) | 0x700000));

    /* select eMMC function pins */
    if (inpw(REG_SYS_PWRON) & 0x08000000)
    {
        /* Set GPI5~10 for eMMC */
        outpw(REG_SYS_GPI_MFPL, 0x66600000);
        outpw(REG_SYS_GPI_MFPH, 0x00000666);
    }
    else
    {
        /* Set GPC0~6 for eMMC */
        outpw(REG_SYS_GPC_MFPL, 0x00666666);
    }
}


/*---------------------------------------------------------*/
/* User Provided RTC Function for FatFs module             */
/*---------------------------------------------------------*/
/* This is a real time clock service to be called from     */
/* FatFs module. Any valid time must be returned even if   */
/* the system does not support an RTC.                     */
/* This function is not required in read-only cfg.         */

unsigned long get_fattime (void)
{
    unsigned long tmr;

    tmr=0x00000;

    return tmr;
}


static FIL file1, file2;        /* File objects */

/*----------------------------------------------------------------------------
  MAIN function
 *----------------------------------------------------------------------------*/
int32_t main(void)
{
    char 		*ptr, *ptr2;
    long 		p1, p2, p3;
    BYTE 		*buf;
    FATFS 		*fs;              /* Pointer to file system object */
    TCHAR		eMMC_path[] = { '2', ':', 0 };    /* eMMC drive started from 0 */
    FRESULT 	res;

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

	sysInitializeUART();
    sysprintf("\n");
    sysprintf("=============================================\n");
    sysprintf("          eMMC Card Testing                  \n");
    sysprintf("=============================================\n");

	sysDisableCache();
	sysInvalidCache();
	sysSetMMUMappingMethod(MMU_DIRECT_MAPPING);
	sysEnableCache(CACHE_WRITE_BACK);

	Buff = (BYTE *)((UINT32)&Buff_Pool[0] | 0x80000000);   /* use non-cache buffer */

    SYS_Init();

    sysInstallISR(HIGH_LEVEL_SENSITIVE|IRQ_LEVEL_1, FMI_IRQn, (PVOID)FMI_IRQHandler);
    /* enable CPSR I bit */
    sysSetLocalInterrupt(ENABLE_IRQ);
	sysEnableInterrupt(FMI_IRQn);

	/*--- init timer ---*/
	sysSetTimerReferenceClock (TIMER0, 12000000);
	sysStartTimer(TIMER0, 100, PERIODIC_MODE);
	
    sysprintf("\n\nNUC970 FMI eMMC FATFS TEST!\n");
    FMI_SetReferenceClock(300000);
    eMMC_Open_Disk();
	f_chdrive(eMMC_path);          /* set default path */

    for (;;) {

        sysprintf(_T(">"));
        ptr = Line;
        get_line(ptr, sizeof(Line));
        switch (*ptr++) {

        case 'q' :  /* Exit program */
            return 0;

        case '0' :
        case '1' :
        	ptr--;
        	*(ptr+1) = ':';
        	*(ptr+2) = 0;
        	put_rc(f_chdrive((TCHAR *)ptr));
        	break;

        case 'd' :
            switch (*ptr++) {
            case 'd' :  /* dd [<lba>] - Dump sector */
                if (!xatoi(&ptr, &p2)) p2 = sect;
                res = (FRESULT)disk_read(SD_Drv, Buff, p2, 1);
                if (res) {
                    sysprintf("rc=%d\n", (WORD)res);
                    break;
                }
                sect = p2 + 1;
                sysprintf("Sector:%d\n", p2);
                for (buf=(unsigned char*)Buff, ofs = 0; ofs < 0x200; buf+=16, ofs+=16)
                    put_dump(buf, ofs, 16);
                break;

            }
            break;

        case 'b' :
            switch (*ptr++) {
            case 'd' :  /* bd <addr> - Dump R/W buffer */
                if (!xatoi(&ptr, &p1)) break;
                for (ptr=(char*)&Buff[p1], ofs = p1, cnt = 32; cnt; cnt--, ptr+=16, ofs+=16)
                    put_dump((BYTE*)ptr, ofs, 16);
                break;

            case 'e' :  /* be <addr> [<data>] ... - Edit R/W buffer */
                if (!xatoi(&ptr, &p1)) break;
                if (xatoi(&ptr, &p2)) {
                    do {
                        Buff[p1++] = (BYTE)p2;
                    } while (xatoi(&ptr, &p2));
                    break;
                }
                for (;;) {
                    sysprintf("%04X %02X-", (WORD)p1, Buff[p1]);
                    get_line(Line, sizeof(Line));
                    ptr = Line;
                    if (*ptr == '.') break;
                    if (*ptr < ' ') {
                        p1++;
                        continue;
                    }
                    if (xatoi(&ptr, &p2))
                        Buff[p1++] = (BYTE)p2;
                    else
                        sysprintf("???\n");
                }
                break;

            case 'r' :  /* br <sector> [<n>] - Read disk into R/W buffer */
                if (!xatoi(&ptr, &p2)) break;
                if (!xatoi(&ptr, &p3)) p3 = 1;
                sysprintf("rc=%d\n", disk_read(SD_Drv, Buff, p2, p3));
                break;

